# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Binaries
brew "bat"
brew "coreutils"
# brew "dockutil" # https://github.com/kcrawford/dockutil/issues/127
brew "gh"
brew "jq"
brew "mas"
brew "starship"
brew "thefuck"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps
cask "chromium"
cask "discord"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
