# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Binaries
brew "bat"
brew "bun"
brew "coreutils"
brew "deno"
brew "fzf"
# brew "dockutil" # https://github.com/kcrawford/dockutil/issues/127
brew "gh"
brew "git"
brew "jq"
brew "mas"
brew "node"
brew "pnpm"
brew "starship"
brew "thefuck"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Apps
cask "discord"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "iterm2"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "visual-studio-code"
cask "warp"

# Fonts
cask "font-fira-code"
